{
  "version": "V13.0",
  "description": "Semantic fraction vocabulary for V13.0 tokenizer",
  "source_dataset": "supercon_fractions_contrastive.csv",
  "n_formulas": 52813,
  "n_fractions": 4317,
  "total_fraction_occurrences": 69732,
  "coverage": {
    "top_50pct": 27,
    "top_90pct": 609,
    "top_95pct": 1444,
    "top_99pct": 3620,
    "top_100pct": 4317
  },
  "max_numerator": 1019949,
  "max_denominator": 100000,
  "fractions": [
    "1/2",
    "1/5",
    "1/10",
    "2/5",
    "3/10",
    "4/5",
    "3/5",
    "9/10",
    "3/20",
    "7/10",
    "1/20",
    "1/4",
    "3/2",
    "3/4",
    "9/5",
    "8/5",
    "19/20",
    "1/50",
    "17/20",
    "1/100",
    "3/50",
    "19/10",
    "3/100",
    "6/5",
    "17/10",
    "1/25",
    "37/20",
    "7/5",
    "99/100",
    "49/50",
    "7/20",
    "2/25",
    "5/2",
    "3/25",
    "13/20",
    "97/100",
    "27/10",
    "9/20",
    "33/100",
    "11/10",
    "13/10",
    "24/25",
    "21/10",
    "9/50",
    "4/25",
    "5/4",
    "39/20",
    "14/5",
    "11/20",
    "47/50",
    "9/100",
    "23/25",
    "7/4",
    "57/20",
    "29/10",
    "1/40",
    "7/50",
    "11/100",
    "1/200",
    "3/40",
    "22/25",
    "67/100",
    "11/50",
    "7/100",
    "6/25",
    "1/8",
    "99/50",
    "147/50",
    "12/5",
    "33/20",
    "13/100",
    "17/100",
    "69/10",
    "93/100",
    "21/100",
    "11/5",
    "89/100",
    "91/100",
    "7/25",
    "3/200",
    "13/5",
    "199/200",
    "139/20",
    "7/2",
    "49/25",
    "59/20",
    "27/100",
    "41/50",
    "46/25",
    "21/25",
    "9/25",
    "18/25",
    "48/25",
    "39/40",
    "97/50",
    "11/4",
    "297/100",
    "43/50",
    "17/50",
    "19/100",
    "8/25",
    "39/50",
    "23/100",
    "19/25",
    "27/20",
    "37/50",
    "21/50",
    "23/20",
    "87/100",
    "21/20",
    "9/2",
    "12/25",
    "31/20",
    "16/25",
    "47/25",
    "37/40",
    "19/50",
    "197/200",
    "33/50",
    "49/100",
    "199/100",
    "18/5",
    "29/20",
    "53/100",
    "16/5",
    "91/50",
    "93/50",
    "17/25",
    "47/100",
    "137/20",
    "197/100",
    "27/50",
    "34/5",
    "13/25",
    "173/25",
    "174/25",
    "29/50",
    "83/100",
    "193/100",
    "73/100",
    "37/100",
    "23/10",
    "67/10",
    "347/50",
    "691/100",
    "9/4",
    "31/50",
    "291/100",
    "13/2",
    "13/50",
    "349/50",
    "1/1000",
    "72/25",
    "23/50",
    "63/100",
    "693/100",
    "15/2",
    "33/10",
    "14/25",
    "81/100",
    "133/100",
    "149/50",
    "29/100",
    "697/100",
    "23/2",
    "77/100",
    "9/40",
    "101/100",
    "33/5",
    "31/100",
    "17/5",
    "7/8",
    "89/50",
    "51/20",
    "183/100",
    "19/5",
    "57/100",
    "79/100",
    "11/25",
    "44/25",
    "7/40",
    "1/500",
    "39/10",
    "201/100",
    "9/200",
    "41/100",
    "187/100",
    "15/8",
    "191/100",
    "43/100",
    "71/100",
    "172/25",
    "39/100",
    "51/100",
    "61/100",
    "69/100",
    "689/100",
    "141/50",
    "27/4",
    "71/10",
    "74/25",
    "51/50",
    "103/100",
    "1/125",
    "999/1000",
    "41/20",
    "26/25",
    "499/500",
    "189/100",
    "31/10",
    "41/25",
    "199/50",
    "1/250",
    "11/2",
    "181/100",
    "25/2",
    "3/500",
    "9/500",
    "267/100",
    "279/100",
    "3/250",
    "36/5",
    "24/5",
    "43/20",
    "43/25",
    "171/25",
    "59/100",
    "179/100",
    "203/100",
    "1/400",
    "27/25",
    "7/200",
    "19/2",
    "69/25",
    "117/40",
    "23/200",
    "23/5",
    "133/20",
    "299/100",
    "31/5",
    "32/5",
    "63/10",
    "42/25",
    "339/50",
    "699/100",
    "21/200",
    "3/1000",
    "7/1000",
    "99/25",
    "17/1000",
    "21/5",
    "73/25",
    "83/50",
    "341/50",
    "177/100",
    "399/100",
    "58/5",
    "79/20",
    "77/40",
    "343/50",
    "167/100",
    "37/200",
    "249/250",
    "17/2",
    "21/2",
    "3/8",
    "37/25",
    "87/50",
    "173/100",
    "397/100",
    "2/125",
    "13/200",
    "701/100",
    "3/125",
    "124/125",
    "193/200",
    "9/1000",
    "22/5",
    "39/5",
    "37/10",
    "141/20",
    "169/25",
    "67/50",
    "101/50",
    "1/80",
    "687/100",
    "33/200",
    "7/500",
    "13/1000",
    "333/1000",
    "61/10",
    "29/25",
    "413/50",
    "683/100",
    "11/200",
    "27/2",
    "54/5",
    "73/10",
    "79/10",
    "127/20",
    "28/25",
    "36/25",
    "39/25",
    "177/25",
    "53/50",
    "57/50",
    "353/50",
    "111/100",
    "597/200",
    "9/250",
    "3/400",
    "399/400",
    "5/8",
    "49/10",
    "38/25",
    "59/50",
    "351/50",
    "681/100",
    "703/100",
    "707/100",
    "27/200",
    "191/200",
    "27/1000",
    "28/5",
    "38/5",
    "57/10",
    "179/25",
    "33/40",
    "79/40",
    "107/100",
    "17/200",
    "7/250",
    "247/250",
    "11/500",
    "41/5",
    "43/10",
    "93/10",
    "143/20",
    "129/25",
    "167/25",
    "168/25",
    "19/40",
    "81/50",
    "217/100",
    "11/250",
    "13/250",
    "497/500",
    "21/1000",
    "983/1000",
    "993/1000",
    "997/1000",
    "47/5",
    "57/5",
    "51/10",
    "32/25",
    "111/40",
    "63/50",
    "337/50",
    "207/100",
    "293/100",
    "663/100",
    "51/200",
    "47/500",
    "489/500",
    "987/1000",
    "31/2",
    "42/5",
    "178/25",
    "119/40",
    "77/50",
    "169/100",
    "31/200",
    "397/200",
    "591/200",
    "21/500",
    "167/1000",
    "991/1000",
    "37/5",
    "83/10",
    "77/20",
    "53/25",
    "66/25",
    "73/50",
    "109/100",
    "661/100",
    "669/100",
    "679/100",
    "491/500",
    "27/5",
    "81/10",
    "117/10",
    "53/20",
    "33/25",
    "54/25",
    "31/40",
    "79/50",
    "107/50",
    "329/50",
    "163/100",
    "171/100",
    "227/100",
    "273/100",
    "711/100",
    "377/200",
    "399/200",
    "19/500",
    "33/1000",
    "81/1000",
    "99/1000",
    "15/4",
    "33/4",
    "26/5",
    "87/10",
    "91/10",
    "333/10",
    "97/25",
    "176/25",
    "21/40",
    "73/40",
    "129/50",
    "357/50",
    "149/100",
    "667/100",
    "677/100",
    "6/125",
    "163/200",
    "187/200",
    "19/250",
    "13/500",
    "33/500",
    "37/500",
    "973/1000",
    "13/4",
    "49/5",
    "41/10",
    "47/10",
    "77/10",
    "223/10",
    "47/20",
    "99/20",
    "31/25",
    "98/25",
    "159/25",
    "162/25",
    "163/25",
    "166/25",
    "11/40",
    "61/50",
    "69/50",
    "113/100",
    "161/100",
    "671/100",
    "673/100",
    "123/125",
    "27/500",
    "77/500",
    "493/500",
    "11/1000",
    "667/1000",
    "1333/1000",
    "55/2",
    "43/5",
    "48/5",
    "52/5",
    "59/5",
    "143/10",
    "63/25",
    "309/100",
    "653/100",
    "12/125",
    "39/200",
    "111/200",
    "183/200",
    "33/250",
    "23/500",
    "83/500",
    "19/1000",
    "51/1000",
    "979/1000",
    "33/2",
    "147/2",
    "56/5",
    "119/10",
    "159/20",
    "34/25",
    "51/25",
    "164/25",
    "71/50",
    "103/50",
    "331/50",
    "261/100",
    "289/100",
    "603/100",
    "821/100",
    "7/125",
    "8/125",
    "19/200",
    "333/200",
    "813/200",
    "1393/200",
    "17/250",
    "1491/500",
    "23/1000",
    "39/1000",
    "43/1000",
    "69/1000",
    "989/1000",
    "19/4",
    "25/4",
    "46/5",
    "83/5",
    "109/10",
    "63/20",
    "123/20",
    "151/25",
    "154/25",
    "207/25",
    "139/50",
    "153/50",
    "333/50",
    "359/50",
    "117/100",
    "159/100",
    "393/100",
    "659/100",
    "719/100",
    "833/100",
    "122/125",
    "29/200",
    "169/200",
    "27/250",
    "39/250",
    "17/500",
    "41/500",
    "43/500",
    "57/500",
    "59/500",
    "49/1000",
    "967/1000",
    "37/2",
    "75/2",
    "17/4",
    "21/4",
    "29/5",
    "97/10",
    "103/10",
    "1/16",
    "69/20",
    "131/20",
    "93/25",
    "96/25",
    "159/40",
    "117/50",
    "197/50",
    "201/50",
    "321/50",
    "79/80",
    "129/100",
    "137/100",
    "153/100",
    "311/100",
    "403/100",
    "729/100",
    "827/100",
    "9/125",
    "13/125",
    "232/125",
    "57/200",
    "137/200",
    "177/200",
    "189/200",
    "259/200",
    "579/200",
    "241/250",
    "497/250",
    "747/250",
    "9/400",
    "397/400",
    "49/500",
    "51/500",
    "61/500",
    "63/500",
    "87/500",
    "1497/500",
    "47/1000",
    "57/1000",
    "61/1000",
    "73/1000",
    "101/1000",
    "51/2",
    "99/10",
    "111/10",
    "129/20",
    "52/25",
    "161/25",
    "204/25",
    "17/40",
    "29/40",
    "111/50",
    "137/50",
    "327/50",
    "411/50",
    "17/80",
    "121/100",
    "143/100",
    "301/100",
    "613/100",
    "647/100",
    "651/100",
    "709/100",
    "819/100",
    "4/125",
    "14/125",
    "23/125",
    "24/125",
    "63/200",
    "67/200",
    "149/200",
    "161/200",
    "369/200",
    "387/200",
    "21/250",
    "31/250",
    "499/250",
    "31/500",
    "39/500",
    "53/500",
    "99/500",
    "87/1000",
    "113/1000",
    "117/1000",
    "143/1000",
    "957/1000",
    "963/1000",
    "977/1000",
    "981/1000",
    "1943/1000",
    "85/2",
    "167/2",
    "37/4",
    "44/5",
    "64/5",
    "59/10",
    "113/10",
    "167/10",
    "81/20",
    "97/20",
    "163/20",
    "57/25",
    "127/25",
    "248/25",
    "13/40",
    "27/40",
    "157/40",
    "151/50",
    "157/50",
    "159/50",
    "257/50",
    "127/100",
    "211/100",
    "213/100",
    "237/100",
    "401/100",
    "649/100",
    "721/100",
    "823/100",
    "17/125",
    "33/125",
    "244/125",
    "248/125",
    "249/125",
    "41/200",
    "91/200",
    "171/200",
    "179/200",
    "367/200",
    "371/200",
    "379/200",
    "23/250",
    "239/250",
    "37/400",
    "703/400",
    "73/500",
    "423/500",
    "963/500",
    "4121/500",
    "29/1000",
    "37/1000",
    "41/1000",
    "67/1000",
    "201/1000",
    "287/1000",
    "901/1000",
    "971/1000",
    "1983/1000",
    "2919/1000",
    "35/2",
    "79/2",
    "145/2",
    "155/2",
    "29/4",
    "55/4",
    "51/5",
    "68/5",
    "78/5",
    "107/10",
    "203/10",
    "323/10",
    "61/20",
    "121/20",
    "149/20",
    "167/20",
    "239/20",
    "77/25",
    "101/25",
    "102/25",
    "152/25",
    "157/25",
    "119/50",
    "203/50",
    "249/50",
    "253/50",
    "147/100",
    "157/100",
    "257/100",
    "319/100",
    "509/100",
    "519/100",
    "601/100",
    "619/100",
    "631/100",
    "723/100",
    "841/100",
    "19/125",
    "26/125",
    "41/125",
    "98/125",
    "119/125",
    "49/200",
    "119/200",
    "153/200",
    "167/200",
    "173/200",
    "181/200",
    "393/200",
    "10149/200",
    "41/250",
    "57/250",
    "1/392",
    "7/400",
    "393/400",
    "69/500",
    "89/500",
    "459/500",
    "477/500",
    "479/500",
    "483/500",
    "973/500",
    "1/625",
    "477/940",
    "109/1000",
    "153/1000",
    "297/1000",
    "573/1000",
    "899/1000",
    "953/1000",
    "29/2",
    "39/2",
    "45/2",
    "65/2",
    "137/2",
    "157/2",
    "173/2",
    "65/4",
    "71/5",
    "96/5",
    "117/5",
    "149/5",
    "9/8",
    "101/10",
    "153/10",
    "157/10",
    "497/10",
    "15/16",
    "101/20",
    "147/20",
    "153/20",
    "187/20",
    "217/20",
    "56/25",
    "59/25",
    "67/25",
    "71/25",
    "94/25",
    "108/25",
    "128/25",
    "153/25",
    "156/25",
    "158/25",
    "183/25",
    "206/25",
    "253/25",
    "23/40",
    "71/40",
    "81/40",
    "109/50",
    "123/50",
    "143/50",
    "299/50",
    "301/50",
    "303/50",
    "309/50",
    "313/50",
    "319/50",
    "409/50",
    "7/80",
    "11/80",
    "123/100",
    "151/100",
    "233/100",
    "277/100",
    "283/100",
    "303/100",
    "407/100",
    "409/100",
    "611/100",
    "617/100",
    "621/100",
    "623/100",
    "643/100",
    "713/100",
    "877/100",
    "11/125",
    "18/125",
    "21/125",
    "29/125",
    "36/125",
    "72/125",
    "92/125",
    "118/125",
    "121/125",
    "217/125",
    "236/125",
    "238/125",
    "504/125",
    "79/200",
    "99/200",
    "157/200",
    "373/200",
    "389/200",
    "599/200",
    "29/250",
    "37/250",
    "43/250",
    "49/250",
    "63/250",
    "99/250",
    "147/250",
    "243/250",
    "461/250",
    "467/250",
    "481/250",
    "493/250",
    "993/250",
    "111/400",
    "629/400",
    "1191/400",
    "1/435",
    "97/500",
    "111/500",
    "147/500",
    "441/500",
    "453/500",
    "481/500",
    "487/500",
    "943/500",
    "951/500",
    "979/500",
    "991/500",
    "3431/500",
    "3/625",
    "624/625",
    "31/1000",
    "53/1000",
    "59/1000",
    "63/1000",
    "71/1000",
    "91/1000",
    "93/1000",
    "97/1000",
    "199/1000",
    "203/1000",
    "253/1000",
    "737/1000",
    "741/1000",
    "747/1000",
    "857/1000",
    "887/1000",
    "913/1000",
    "961/1000",
    "1837/1000",
    "1987/1000",
    "2961/1000",
    "2999/1000",
    "6999/1000",
    "41/2",
    "67/2",
    "73/2",
    "121/2",
    "127/2",
    "135/2",
    "45/4",
    "165/4",
    "199/4",
    "53/5",
    "72/5",
    "76/5",
    "98/5",
    "102/5",
    "108/5",
    "112/5",
    "118/5",
    "119/5",
    "137/5",
    "312/5",
    "39/8",
    "89/10",
    "139/10",
    "159/10",
    "213/10",
    "247/10",
    "273/10",
    "857/10",
    "87/20",
    "93/20",
    "103/20",
    "107/20",
    "161/20",
    "169/20",
    "189/20",
    "191/20",
    "221/20",
    "237/20",
    "1999/20",
    "82/25",
    "123/25",
    "181/25",
    "182/25",
    "203/25",
    "256/25",
    "359/25",
    "69/40",
    "279/40",
    "161/50",
    "259/50",
    "261/50",
    "307/50",
    "311/50",
    "323/50",
    "367/50",
    "377/50",
    "403/50",
    "513/50",
    "599/50",
    "3/80",
    "13/80",
    "19/80",
    "33/80",
    "119/100",
    "131/100",
    "139/100",
    "209/100",
    "219/100",
    "243/100",
    "269/100",
    "281/100",
    "287/100",
    "357/100",
    "497/100",
    "607/100",
    "609/100",
    "717/100",
    "817/100",
    "831/100",
    "887/100",
    "22/125",
    "47/125",
    "48/125",
    "49/125",
    "61/125",
    "63/125",
    "96/125",
    "113/125",
    "242/125",
    "246/125",
    "372/125",
    "866/125",
    "53/200",
    "69/200",
    "73/200",
    "81/200",
    "89/200",
    "127/200",
    "133/200",
    "201/200",
    "203/200",
    "343/200",
    "359/200",
    "361/200",
    "363/200",
    "381/200",
    "391/200",
    "573/200",
    "1391/200",
    "47/250",
    "51/250",
    "141/250",
    "223/250",
    "231/250",
    "237/250",
    "459/250",
    "473/250",
    "477/250",
    "991/250",
    "1707/250",
    "38/329",
    "71/331",
    "199/400",
    "1197/400",
    "71/500",
    "79/500",
    "91/500",
    "107/500",
    "123/500",
    "139/500",
    "153/500",
    "287/500",
    "297/500",
    "309/500",
    "333/500",
    "351/500",
    "439/500",
    "891/500",
    "899/500",
    "913/500",
    "921/500",
    "937/500",
    "941/500",
    "947/500",
    "961/500",
    "1479/500",
    "3477/500",
    "77/1000",
    "131/1000",
    "151/1000",
    "179/1000",
    "213/1000",
    "263/1000",
    "499/1000",
    "749/1000",
    "767/1000",
    "927/1000",
    "937/1000",
    "941/1000",
    "943/1000",
    "969/1000",
    "1991/1000",
    "2799/1000",
    "2901/1000",
    "2931/1000",
    "2949/1000",
    "2979/1000",
    "4093/1000",
    "6929/1000",
    "6943/1000",
    "6953/1000",
    "6987/1000",
    "37/2000",
    "43/2",
    "53/2",
    "91/2",
    "97/2",
    "105/2",
    "107/2",
    "109/2",
    "139/2",
    "143/2",
    "153/2",
    "161/2",
    "171/2",
    "31/4",
    "39/4",
    "41/4",
    "47/4",
    "81/4",
    "161/4",
    "61/5",
    "69/5",
    "73/5",
    "74/5",
    "82/5",
    "92/5",
    "114/5",
    "121/5",
    "122/5",
    "127/5",
    "136/5",
    "138/5",
    "144/5",
    "176/5",
    "182/5",
    "251/5",
    "252/5",
    "256/5",
    "309/5",
    "333/5",
    "23/8",
    "31/8",
    "53/10",
    "129/10",
    "151/10",
    "171/10",
    "187/10",
    "197/10",
    "221/10",
    "253/10",
    "307/10",
    "343/10",
    "399/10",
    "503/10",
    "513/10",
    "517/10",
    "567/10",
    "601/10",
    "643/10",
    "667/10",
    "727/10",
    "3/16",
    "67/20",
    "109/20",
    "111/20",
    "151/20",
    "199/20",
    "241/20",
    "297/20",
    "58/25",
    "61/25",
    "64/25",
    "76/25",
    "83/25",
    "92/25",
    "103/25",
    "121/25",
    "122/25",
    "146/25",
    "191/25",
    "199/25",
    "229/25",
    "243/25",
    "286/25",
    "298/25",
    "299/25",
    "41/40",
    "67/40",
    "107/40",
    "199/40",
    "121/50",
    "127/50",
    "133/50",
    "167/50",
    "189/50",
    "191/50",
    "193/50",
    "209/50",
    "241/50",
    "243/50",
    "251/50",
    "289/50",
    "297/50",
    "361/50",
    "371/50",
    "451/50",
    "453/50",
    "719/50",
    "57/80",
    "141/100",
    "221/100",
    "223/100",
    "229/100",
    "239/100",
    "249/100",
    "263/100",
    "307/100",
    "313/100",
    "317/100",
    "323/100",
    "333/100",
    "411/100",
    "413/100",
    "419/100",
    "423/100",
    "427/100",
    "507/100",
    "511/100",
    "521/100",
    "581/100",
    "597/100",
    "599/100",
    "627/100",
    "633/100",
    "641/100",
    "657/100",
    "727/100",
    "733/100",
    "751/100",
    "801/100",
    "811/100",
    "813/100",
    "843/100",
    "853/100",
    "947/100",
    "1011/100",
    "1023/100",
    "16/125",
    "27/125",
    "32/125",
    "34/125",
    "42/125",
    "52/125",
    "88/125",
    "99/125",
    "101/125",
    "102/125",
    "106/125",
    "116/125",
    "198/125",
    "222/125",
    "224/125",
    "226/125",
    "229/125",
    "373/125",
    "498/125",
    "508/125",
    "857/125",
    "872/125",
    "878/125",
    "929/125",
    "47/200",
    "77/200",
    "129/200",
    "151/200",
    "159/200",
    "207/200",
    "209/200",
    "213/200",
    "383/200",
    "797/200",
    "809/200",
    "1353/200",
    "1359/200",
    "1387/200",
    "1427/200",
    "59/250",
    "129/250",
    "191/250",
    "193/250",
    "203/250",
    "207/250",
    "217/250",
    "443/250",
    "483/250",
    "487/250",
    "489/250",
    "983/250",
    "999/250",
    "1013/250",
    "1733/250",
    "1739/250",
    "1767/250",
    "2973/250",
    "11/400",
    "33/400",
    "133/400",
    "389/400",
    "62/427",
    "434/435",
    "67/500",
    "93/500",
    "101/500",
    "109/500",
    "113/500",
    "117/500",
    "121/500",
    "129/500",
    "131/500",
    "137/500",
    "149/500",
    "173/500",
    "249/500",
    "343/500",
    "349/500",
    "373/500",
    "377/500",
    "443/500",
    "461/500",
    "463/500",
    "467/500",
    "469/500",
    "749/500",
    "911/500",
    "917/500",
    "923/500",
    "927/500",
    "949/500",
    "953/500",
    "957/500",
    "967/500",
    "977/500",
    "999/500",
    "2043/500",
    "3007/500",
    "3429/500",
    "3453/500",
    "197/603",
    "24/625",
    "198/625",
    "194/639",
    "1/667",
    "124/671",
    "37/800",
    "1443/800",
    "239/823",
    "179/866",
    "293/906",
    "295/951",
    "269/959",
    "79/1000",
    "83/1000",
    "89/1000",
    "111/1000",
    "127/1000",
    "129/1000",
    "133/1000",
    "137/1000",
    "147/1000",
    "157/1000",
    "163/1000",
    "181/1000",
    "187/1000",
    "207/1000",
    "219/1000",
    "249/1000",
    "251/1000",
    "261/1000",
    "281/1000",
    "311/1000",
    "501/1000",
    "663/1000",
    "683/1000",
    "693/1000",
    "719/1000",
    "751/1000",
    "779/1000",
    "781/1000",
    "797/1000",
    "833/1000",
    "891/1000",
    "907/1000",
    "923/1000",
    "933/1000",
    "939/1000",
    "947/1000",
    "949/1000",
    "951/1000",
    "1843/1000",
    "1857/1000",
    "1887/1000",
    "1993/1000",
    "2883/1000",
    "2917/1000",
    "2993/1000",
    "3987/1000",
    "4103/1000",
    "6837/1000",
    "7123/1000",
    "1/2000",
    "1997/2000",
    "3663/2000",
    "61/2",
    "63/2",
    "69/2",
    "83/2",
    "101/2",
    "111/2",
    "125/2",
    "159/2",
    "165/2",
    "169/2",
    "175/2",
    "185/2",
    "195/2",
    "23/4",
    "35/4",
    "49/4",
    "67/4",
    "75/4",
    "77/4",
    "157/4",
    "159/4",
    "163/4",
    "261/4",
    "63/5",
    "88/5",
    "94/5",
    "97/5",
    "101/5",
    "111/5",
    "116/5",
    "126/5",
    "128/5",
    "129/5",
    "132/5",
    "133/5",
    "134/5",
    "139/5",
    "148/5",
    "163/5",
    "171/5",
    "172/5",
    "173/5",
    "177/5",
    "187/5",
    "193/5",
    "194/5",
    "206/5",
    "208/5",
    "209/5",
    "223/5",
    "248/5",
    "249/5",
    "258/5",
    "268/5",
    "273/5",
    "301/5",
    "318/5",
    "323/5",
    "332/5",
    "351/5",
    "368/5",
    "369/5",
    "376/5",
    "392/5",
    "396/5",
    "416/5",
    "442/5",
    "496/5",
    "497/5",
    "19/8",
    "37/8",
    "55/8",
    "319/8",
    "123/10",
    "127/10",
    "133/10",
    "149/10",
    "181/10",
    "191/10",
    "193/10",
    "201/10",
    "207/10",
    "237/10",
    "239/10",
    "243/10",
    "261/10",
    "263/10",
    "271/10",
    "277/10",
    "279/10",
    "293/10",
    "313/10",
    "329/10",
    "331/10",
    "349/10",
    "363/10",
    "383/10",
    "387/10",
    "393/10",
    "499/10",
    "509/10",
    "663/10",
    "669/10",
    "687/10",
    "747/10",
    "763/10",
    "791/10",
    "799/10",
    "807/10",
    "997/10",
    "9/16",
    "1/17",
    "49/20",
    "71/20",
    "73/20",
    "83/20",
    "91/20",
    "117/20",
    "119/20",
    "157/20",
    "197/20",
    "227/20",
    "233/20",
    "247/20",
    "289/20",
    "299/20",
    "1363/20",
    "1941/20",
    "62/25",
    "68/25",
    "78/25",
    "79/25",
    "81/25",
    "86/25",
    "87/25",
    "104/25",
    "107/25",
    "117/25",
    "131/25",
    "132/25",
    "133/25",
    "147/25",
    "148/25",
    "184/25",
    "187/25",
    "189/25",
    "192/25",
    "198/25",
    "209/25",
    "211/25",
    "216/25",
    "224/25",
    "226/25",
    "238/25",
    "247/25",
    "254/25",
    "276/25",
    "293/25",
    "327/25",
    "373/25",
    "396/25",
    "611/25",
    "1708/25",
    "43/40",
    "59/40",
    "63/40",
    "93/40",
    "109/40",
    "161/40",
    "163/40",
    "197/40",
    "243/40",
    "113/50",
    "131/50",
    "163/50",
    "169/50",
    "171/50",
    "173/50",
    "221/50",
    "233/50",
    "237/50",
    "293/50",
    "317/50",
    "363/50",
    "373/50",
    "381/50",
    "383/50",
    "387/50",
    "393/50",
    "397/50",
    "417/50",
    "419/50",
    "441/50",
    "461/50",
    "479/50",
    "491/50",
    "507/50",
    "511/50",
    "517/50",
    "543/50",
    "547/50",
    "549/50",
    "553/50",
    "587/50",
    "593/50",
    "613/50",
    "693/50",
    "697/50",
    "703/50",
    "723/50",
    "1121/50",
    "1927/50",
    "4899/50",
    "9/80",
    "21/80",
    "39/80",
    "47/80",
    "247/100",
    "253/100",
    "259/100",
    "351/100",
    "353/100",
    "361/100",
    "363/100",
    "371/100",
    "387/100",
    "433/100",
    "437/100",
    "441/100",
    "461/100",
    "501/100",
    "503/100",
    "529/100",
    "553/100",
    "567/100",
    "591/100",
    "629/100",
    "637/100",
    "731/100",
    "741/100",
    "749/100",
    "757/100",
    "759/100",
    "761/100",
    "767/100",
    "769/100",
    "779/100",
    "781/100",
    "783/100",
    "787/100",
    "803/100",
    "829/100",
    "839/100",
    "849/100",
    "859/100",
    "871/100",
    "881/100",
    "891/100",
    "903/100",
    "911/100",
    "941/100",
    "949/100",
    "951/100",
    "963/100",
    "967/100",
    "991/100",
    "1057/100",
    "1069/100",
    "1089/100",
    "1177/100",
    "1191/100",
    "1193/100",
    "1297/100",
    "1407/100",
    "1453/100",
    "1641/100",
    "9897/100",
    "5/101",
    "28/125",
    "31/125",
    "38/125",
    "44/125",
    "46/125",
    "62/125",
    "71/125",
    "73/125",
    "78/125",
    "81/125",
    "82/125",
    "84/125",
    "87/125",
    "112/125",
    "114/125",
    "117/125",
    "167/125",
    "227/125",
    "228/125",
    "231/125",
    "239/125",
    "247/125",
    "351/125",
    "369/125",
    "491/125",
    "499/125",
    "507/125",
    "512/125",
    "751/125",
    "759/125",
    "841/125",
    "856/125",
    "862/125",
    "864/125",
    "1114/125",
    "1242/125",
    "1244/125",
    "1246/125",
    "1248/125",
    "1311/125",
    "2067/125",
    "43/200",
    "61/200",
    "71/200",
    "93/200",
    "97/200",
    "101/200",
    "107/200",
    "109/200",
    "123/200",
    "141/200",
    "147/200",
    "347/200",
    "357/200",
    "549/200",
    "577/200",
    "593/200",
    "789/200",
    "803/200",
    "807/200",
    "811/200",
    "817/200",
    "819/200",
    "821/200",
    "1211/200",
    "1377/200",
    "1389/200",
    "1399/200",
    "3283/200",
    "151/219",
    "53/250",
    "67/250",
    "69/250",
    "71/250",
    "89/250",
    "97/250",
    "119/250",
    "121/250",
    "123/250",
    "153/250",
    "161/250",
    "181/250",
    "199/250",
    "211/250",
    "213/250",
    "229/250",
    "233/250",
    "259/250",
    "261/250",
    "433/250",
    "453/250",
    "469/250",
    "471/250",
    "479/250",
    "491/250",
    "521/250",
    "717/250",
    "737/250",
    "743/250",
    "977/250",
    "1011/250",
    "1023/250",
    "1249/250",
    "1511/250",
    "1517/250",
    "1721/250",
    "1729/250",
    "1737/250",
    "1741/250",
    "1749/250",
    "1763/250",
    "1771/250",
    "1787/250",
    "3/353",
    "19/400",
    "57/400",
    "99/400",
    "237/400",
    "247/400",
    "291/400",
    "297/400",
    "323/400",
    "347/400",
    "361/400",
    "1167/400",
    "29/500",
    "81/500",
    "119/500",
    "127/500",
    "151/500",
    "191/500",
    "197/500",
    "203/500",
    "213/500",
    "237/500",
    "247/500",
    "251/500",
    "263/500",
    "267/500",
    "273/500",
    "313/500",
    "319/500",
    "347/500",
    "357/500",
    "361/500",
    "379/500",
    "389/500",
    "393/500",
    "399/500",
    "407/500",
    "409/500",
    "413/500",
    "427/500",
    "429/500",
    "437/500",
    "447/500",
    "449/500",
    "451/500",
    "457/500",
    "473/500",
    "501/500",
    "509/500",
    "547/500",
    "683/500",
    "781/500",
    "869/500",
    "883/500",
    "887/500",
    "903/500",
    "929/500",
    "933/500",
    "969/500",
    "981/500",
    "987/500",
    "997/500",
    "1353/500",
    "1389/500",
    "1407/500",
    "1449/500",
    "1467/500",
    "1477/500",
    "1989/500",
    "1997/500",
    "1999/500",
    "2009/500",
    "2011/500",
    "2017/500",
    "2027/500",
    "2029/500",
    "2031/500",
    "2033/500",
    "2053/500",
    "3167/500",
    "3333/500",
    "3439/500",
    "3447/500",
    "3463/500",
    "3467/500",
    "3469/500",
    "3473/500",
    "3481/500",
    "3491/500",
    "3501/500",
    "3541/500",
    "3731/500",
    "4117/500",
    "8287/500",
    "151/511",
    "2103/526",
    "491/533",
    "38/539",
    "501/539",
    "574/577",
    "8/597",
    "1186/597",
    "248/625",
    "249/625",
    "622/625",
    "992/625",
    "994/625",
    "996/625",
    "998/625",
    "4/635",
    "5/641",
    "51/653",
    "666/667",
    "299/749",
    "2/769",
    "767/769",
    "1/800",
    "111/800",
    "799/800",
    "1369/800",
    "3330/833",
    "4/889",
    "5/909",
    "904/909",
    "365/918",
    "7/921",
    "914/921",
    "103/1000",
    "119/1000",
    "123/1000",
    "141/1000",
    "149/1000",
    "159/1000",
    "177/1000",
    "193/1000",
    "197/1000",
    "221/1000",
    "223/1000",
    "231/1000",
    "233/1000",
    "243/1000",
    "271/1000",
    "273/1000",
    "279/1000",
    "303/1000",
    "309/1000",
    "361/1000",
    "427/1000",
    "449/1000",
    "459/1000",
    "551/1000",
    "597/1000",
    "603/1000",
    "651/1000",
    "689/1000",
    "727/1000",
    "743/1000",
    "759/1000",
    "763/1000",
    "777/1000",
    "787/1000",
    "793/1000",
    "801/1000",
    "803/1000",
    "807/1000",
    "813/1000",
    "849/1000",
    "851/1000",
    "853/1000",
    "863/1000",
    "881/1000",
    "909/1000",
    "911/1000",
    "919/1000",
    "931/1000",
    "959/1000",
    "1013/1000",
    "1031/1000",
    "1049/1000",
    "1703/1000",
    "1737/1000",
    "1821/1000",
    "1847/1000",
    "1851/1000",
    "1863/1000",
    "1867/1000",
    "1869/1000",
    "1883/1000",
    "1889/1000",
    "1913/1000",
    "1919/1000",
    "1941/1000",
    "1973/1000",
    "1997/1000",
    "1999/1000",
    "2667/1000",
    "2697/1000",
    "2739/1000",
    "2841/1000",
    "2847/1000",
    "2859/1000",
    "2871/1000",
    "2927/1000",
    "2943/1000",
    "2967/1000",
    "2973/1000",
    "2989/1000",
    "2997/1000",
    "3967/1000",
    "3971/1000",
    "3997/1000",
    "4003/1000",
    "4021/1000",
    "4023/1000",
    "4027/1000",
    "4043/1000",
    "4047/1000",
    "4049/1000",
    "4063/1000",
    "4073/1000",
    "4079/1000",
    "4081/1000",
    "4087/1000",
    "4099/1000",
    "6311/1000",
    "6333/1000",
    "6731/1000",
    "6761/1000",
    "6773/1000",
    "6801/1000",
    "6807/1000",
    "6809/1000",
    "6813/1000",
    "6817/1000",
    "6819/1000",
    "6821/1000",
    "6829/1000",
    "6849/1000",
    "6907/1000",
    "6909/1000",
    "6927/1000",
    "6937/1000",
    "6941/1000",
    "6951/1000",
    "6957/1000",
    "6959/1000",
    "6969/1000",
    "7001/1000",
    "7079/1000",
    "7087/1000",
    "8199/1000",
    "8211/1000",
    "8329/1000",
    "8373/1000",
    "27057/1000",
    "3/2000",
    "21/2000",
    "33/2000",
    "51/2000",
    "71/2000",
    "111/2000",
    "1929/2000",
    "1979/2000",
    "1999/2000",
    "3589/2000",
    "1/4000",
    "3999/4000",
    "11/5000",
    "221/5000",
    "4989/5000",
    "7/10000",
    "11/10000",
    "89/10000",
    "9911/10000",
    "9989/10000",
    "9993/10000",
    "9997/10000",
    "40631/10000",
    "47/2",
    "49/2",
    "57/2",
    "77/2",
    "81/2",
    "87/2",
    "89/2",
    "93/2",
    "99/2",
    "103/2",
    "115/2",
    "117/2",
    "123/2",
    "129/2",
    "131/2",
    "133/2",
    "141/2",
    "149/2",
    "163/2",
    "177/2",
    "179/2",
    "191/2",
    "193/2",
    "245/2",
    "1/3",
    "2/3",
    "43/4",
    "61/4",
    "73/4",
    "79/4",
    "87/4",
    "93/4",
    "103/4",
    "111/4",
    "123/4",
    "125/4",
    "137/4",
    "183/4",
    "187/4",
    "237/4",
    "273/4",
    "323/4",
    "339/4",
    "365/4",
    "395/4",
    "66/5",
    "77/5",
    "79/5",
    "81/5",
    "86/5",
    "99/5",
    "103/5",
    "104/5",
    "106/5",
    "107/5",
    "109/5",
    "123/5",
    "124/5",
    "141/5",
    "142/5",
    "143/5",
    "147/5",
    "154/5",
    "157/5",
    "158/5",
    "161/5",
    "162/5",
    "166/5",
    "167/5",
    "168/5",
    "169/5",
    "174/5",
    "181/5",
    "183/5",
    "184/5",
    "191/5",
    "196/5",
    "197/5",
    "199/5",
    "201/5",
    "203/5",
    "207/5",
    "217/5",
    "218/5",
    "232/5",
    "244/5",
    "246/5",
    "247/5",
    "257/5",
    "259/5",
    "261/5",
    "262/5",
    "263/5",
    "266/5",
    "271/5",
    "272/5",
    "276/5",
    "283/5",
    "284/5",
    "287/5",
    "288/5",
    "292/5",
    "293/5",
    "297/5",
    "304/5",
    "306/5",
    "313/5",
    "316/5",
    "317/5",
    "326/5",
    "327/5",
    "334/5",
    "341/5",
    "346/5",
    "347/5",
    "352/5",
    "356/5",
    "362/5",
    "364/5",
    "366/5",
    "371/5",
    "379/5",
    "381/5",
    "382/5",
    "386/5",
    "389/5",
    "393/5",
    "402/5",
    "403/5",
    "409/5",
    "414/5",
    "428/5",
    "433/5",
    "446/5",
    "453/5",
    "454/5",
    "462/5",
    "468/5",
    "474/5",
    "476/5",
    "478/5",
    "482/5",
    "486/5",
    "499/5",
    "576/5",
    "734/5",
    "956/5",
    "1101/5",
    "1434/5",
    "3212/5",
    "9481/5",
    "36938/5",
    "40419/5",
    "21/8",
    "51/8",
    "81/8",
    "131/8",
    "161/8",
    "567/8",
    "4/9",
    "121/10",
    "131/10",
    "137/10",
    "141/10",
    "161/10",
    "163/10",
    "173/10",
    "177/10",
    "179/10",
    "189/10",
    "199/10",
    "209/10",
    "211/10",
    "217/10",
    "219/10",
    "229/10",
    "233/10",
    "251/10",
    "257/10",
    "267/10",
    "269/10",
    "281/10",
    "283/10",
    "291/10",
    "301/10",
    "311/10",
    "327/10",
    "337/10",
    "339/10",
    "341/10",
    "347/10",
    "353/10",
    "359/10",
    "361/10",
    "371/10",
    "373/10",
    "381/10",
    "391/10",
    "401/10",
    "409/10",
    "413/10",
    "433/10",
    "441/10",
    "443/10",
    "459/10",
    "479/10",
    "481/10",
    "487/10",
    "493/10",
    "501/10",
    "521/10",
    "529/10",
    "533/10",
    "541/10",
    "549/10",
    "579/10",
    "603/10",
    "607/10",
    "629/10",
    "631/10",
    "637/10",
    "647/10",
    "673/10",
    "691/10",
    "693/10",
    "707/10",
    "713/10",
    "717/10",
    "719/10",
    "729/10",
    "739/10",
    "741/10",
    "759/10",
    "767/10",
    "773/10",
    "779/10",
    "781/10",
    "793/10",
    "797/10",
    "813/10",
    "821/10",
    "823/10",
    "843/10",
    "871/10",
    "873/10",
    "909/10",
    "983/10",
    "991/10",
    "993/10",
    "18867/10",
    "80433/10",
    "1/12",
    "11/12",
    "4/15",
    "7/16",
    "31/16",
    "47/16",
    "65/16",
    "15/19",
    "113/20",
    "171/20",
    "173/20",
    "177/20",
    "179/20",
    "193/20",
    "203/20",
    "207/20",
    "209/20",
    "223/20",
    "229/20",
    "231/20",
    "267/20",
    "271/20",
    "273/20",
    "279/20",
    "283/20",
    "323/20",
    "329/20",
    "333/20",
    "363/20",
    "381/20",
    "421/20",
    "437/20",
    "451/20",
    "489/20",
    "673/20",
    "677/20",
    "689/20",
    "801/20",
    "889/20",
    "949/20",
    "961/20",
    "963/20",
    "999/20",
    "1001/20",
    "1007/20",
    "1051/20",
    "1079/20",
    "1111/20",
    "1323/20",
    "1333/20",
    "1401/20",
    "1479/20",
    "1483/20",
    "1493/20",
    "1503/20",
    "1877/20",
    "1921/20",
    "1947/20",
    "1957/20",
    "1959/20",
    "1983/20",
    "21109/20",
    "48223/20",
    "89557/20",
    "89/25",
    "91/25",
    "106/25",
    "109/25",
    "113/25",
    "119/25",
    "124/25",
    "138/25",
    "144/25",
    "149/25",
    "188/25",
    "194/25",
    "196/25",
    "197/25",
    "201/25",
    "202/25",
    "208/25",
    "212/25",
    "213/25",
    "218/25",
    "219/25",
    "222/25",
    "227/25",
    "232/25",
    "234/25",
    "236/25",
    "241/25",
    "242/25",
    "249/25",
    "251/25",
    "252/25",
    "257/25",
    "261/25",
    "264/25",
    "268/25",
    "272/25",
    "273/25",
    "274/25",
    "288/25",
    "296/25",
    "301/25",
    "304/25",
    "308/25",
    "313/25",
    "329/25",
    "339/25",
    "348/25",
    "351/25",
    "354/25",
    "358/25",
    "361/25",
    "367/25",
    "374/25",
    "378/25",
    "381/25",
    "384/25",
    "407/25",
    "408/25",
    "409/25",
    "413/25",
    "416/25",
    "417/25",
    "422/25",
    "439/25",
    "448/25",
    "453/25",
    "457/25",
    "463/25",
    "467/25",
    "528/25",
    "562/25",
    "616/25",
    "624/25",
    "637/25",
    "768/25",
    "803/25",
    "832/25",
    "854/25",
    "899/25",
    "1046/25",
    "1077/25",
    "1147/25",
    "1229/25",
    "1271/25",
    "1311/25",
    "1627/25",
    "1692/25",
    "1752/25",
    "1754/25",
    "1792/25",
    "1858/25",
    "1868/25",
    "1938/25",
    "1966/25",
    "2037/25",
    "2171/25",
    "2262/25",
    "2301/25",
    "2417/25",
    "2423/25",
    "2431/25",
    "2453/25",
    "2467/25",
    "2469/25",
    "2473/25",
    "2487/25",
    "2498/25",
    "13/27",
    "51/40",
    "57/40",
    "83/40",
    "87/40",
    "99/40",
    "167/40",
    "177/40",
    "181/40",
    "191/40",
    "193/40",
    "227/40",
    "247/40",
    "249/40",
    "267/40",
    "273/40",
    "319/40",
    "581/40",
    "589/40",
    "637/40",
    "3997/40",
    "2/43",
    "127/43",
    "1/49",
    "97/49",
    "181/50",
    "183/50",
    "207/50",
    "211/50",
    "213/50",
    "217/50",
    "227/50",
    "229/50",
    "247/50",
    "277/50",
    "379/50",
    "389/50",
    "399/50",
    "401/50",
    "407/50",
    "427/50",
    "431/50",
    "447/50",
    "457/50",
    "463/50",
    "477/50",
    "487/50",
    "499/50",
    "533/50",
    "537/50",
    "541/50",
    "559/50",
    "591/50",
    "601/50",
    "607/50",
    "647/50",
    "701/50",
    "721/50",
    "727/50",
    "733/50",
    "737/50",
    "739/50",
    "747/50",
    "749/50",
    "761/50",
    "769/50",
    "791/50",
    "801/50",
    "817/50",
    "819/50",
    "821/50",
    "827/50",
    "831/50",
    "857/50",
    "859/50",
    "929/50",
    "969/50",
    "983/50",
    "989/50",
    "1131/50",
    "1227/50",
    "1229/50",
    "1333/50",
    "1397/50",
    "1639/50",
    "1747/50",
    "1761/50",
    "1769/50",
    "2019/50",
    "2257/50",
    "2371/50",
    "2457/50",
    "2473/50",
    "2527/50",
    "2543/50",
    "2629/50",
    "2637/50",
    "2669/50",
    "2981/50",
    "3231/50",
    "3347/50",
    "3889/50",
    "4171/50",
    "4657/50",
    "4739/50",
    "4749/50",
    "4801/50",
    "4863/50",
    "4917/50",
    "4949/50",
    "4989/50",
    "41/63",
    "27/80",
    "31/80",
    "51/80",
    "73/80",
    "137/80",
    "141/80",
    "143/80",
    "157/80",
    "159/80",
    "219/80",
    "239/80",
    "319/80",
    "397/80",
    "1/87",
    "19/90",
    "73/90",
    "619/91",
    "2/93",
    "17/93",
    "76/93",
    "91/93",
    "1/98",
    "97/98",
    "2/99",
    "196/99",
    "251/100",
    "271/100",
    "327/100",
    "329/100",
    "337/100",
    "339/100",
    "341/100",
    "347/100",
    "349/100",
    "359/100",
    "367/100",
    "383/100",
    "389/100",
    "417/100",
    "421/100",
    "429/100",
    "431/100",
    "439/100",
    "449/100",
    "451/100",
    "453/100",
    "457/100",
    "459/100",
    "463/100",
    "477/100",
    "491/100",
    "493/100",
    "517/100",
    "569/100",
    "579/100",
    "583/100",
    "587/100",
    "593/100",
    "639/100",
    "739/100",
    "743/100",
    "753/100",
    "763/100",
    "771/100",
    "777/100",
    "791/100",
    "793/100",
    "799/100",
    "807/100",
    "809/100",
    "851/100",
    "861/100",
    "899/100",
    "907/100",
    "909/100",
    "917/100",
    "921/100",
    "923/100",
    "929/100",
    "939/100",
    "943/100",
    "953/100",
    "957/100",
    "959/100",
    "973/100",
    "979/100",
    "983/100",
    "999/100",
    "1001/100",
    "1007/100",
    "1021/100",
    "1027/100",
    "1077/100",
    "1081/100",
    "1083/100",
    "1097/100",
    "1151/100",
    "1157/100",
    "1167/100",
    "1169/100",
    "1189/100",
    "1203/100",
    "1249/100",
    "1287/100",
    "1289/100",
    "1309/100",
    "1333/100",
    "1351/100",
    "1353/100",
    "1381/100",
    "1391/100",
    "1393/100",
    "1399/100",
    "1401/100",
    "1403/100",
    "1413/100",
    "1417/100",
    "1419/100",
    "1421/100",
    "1427/100",
    "1431/100",
    "1433/100",
    "1437/100",
    "1439/100",
    "1449/100",
    "1457/100",
    "1459/100",
    "1461/100",
    "1479/100",
    "1481/100",
    "1497/100",
    "1503/100",
    "1509/100",
    "1517/100",
    "1533/100",
    "1547/100",
    "1629/100",
    "1653/100",
    "1657/100",
    "1667/100",
    "1673/100",
    "1691/100",
    "1703/100",
    "1731/100",
    "1827/100",
    "1839/100",
    "1843/100",
    "1849/100",
    "1859/100",
    "1863/100",
    "2013/100",
    "2037/100",
    "2161/100",
    "2181/100",
    "2241/100",
    "2327/100",
    "2493/100",
    "2553/100",
    "2771/100",
    "2783/100",
    "2797/100",
    "3413/100",
    "3723/100",
    "3857/100",
    "3953/100",
    "3983/100",
    "4001/100",
    "4033/100",
    "4093/100",
    "4743/100",
    "4829/100",
    "4883/100",
    "4909/100",
    "4929/100",
    "4933/100",
    "4939/100",
    "4953/100",
    "4981/100",
    "4983/100",
    "5019/100",
    "5049/100",
    "5053/100",
    "5061/100",
    "5067/100",
    "5071/100",
    "5091/100",
    "5117/100",
    "5133/100",
    "5171/100",
    "5237/100",
    "5581/100",
    "5611/100",
    "6277/100",
    "6943/100",
    "7003/100",
    "7217/100",
    "7489/100",
    "8739/100",
    "9167/100",
    "9491/100",
    "9671/100",
    "9677/100",
    "9947/100",
    "9981/100",
    "9999/100",
    "1/101",
    "4/101",
    "100/101",
    "301/101",
    "1/114",
    "1/115",
    "114/115",
    "37/125",
    "39/125",
    "43/125",
    "54/125",
    "56/125",
    "57/125",
    "58/125",
    "64/125",
    "66/125",
    "67/125",
    "68/125",
    "69/125",
    "74/125",
    "76/125",
    "79/125",
    "93/125",
    "94/125",
    "97/125",
    "103/125",
    "104/125",
    "107/125",
    "109/125",
    "111/125",
    "126/125",
    "127/125",
    "129/125",
    "134/125",
    "141/125",
    "153/125",
    "169/125",
    "189/125",
    "194/125",
    "196/125",
    "219/125",
    "221/125",
    "223/125",
    "233/125",
    "234/125",
    "237/125",
    "243/125",
    "268/125",
    "274/125",
    "281/125",
    "306/125",
    "339/125",
    "357/125",
    "366/125",
    "477/125",
    "479/125",
    "481/125",
    "483/125",
    "484/125",
    "494/125",
    "497/125",
    "503/125",
    "509/125",
    "516/125",
    "517/125",
    "518/125",
    "526/125",
    "608/125",
    "739/125",
    "757/125",
    "761/125",
    "763/125",
    "768/125",
    "769/125",
    "781/125",
    "791/125",
    "801/125",
    "832/125",
    "836/125",
    "849/125",
    "858/125",
    "859/125",
    "861/125",
    "863/125",
    "868/125",
    "869/125",
    "873/125",
    "874/125",
    "876/125",
    "889/125",
    "893/125",
    "894/125",
    "901/125",
    "903/125",
    "928/125",
    "998/125",
    "1013/125",
    "1017/125",
    "1026/125",
    "1027/125",
    "1028/125",
    "1031/125",
    "1032/125",
    "1034/125",
    "1036/125",
    "1124/125",
    "1293/125",
    "1428/125",
    "1458/125",
    "1484/125",
    "1714/125",
    "1716/125",
    "1776/125",
    "1829/125",
    "2042/125",
    "2069/125",
    "2074/125",
    "4239/125",
    "9204/125",
    "9516/125",
    "12496/125",
    "12497/125",
    "12498/125",
    "12499/125",
    "4/127",
    "12696/127",
    "2/137",
    "4/137",
    "135/137",
    "270/137",
    "72/143",
    "1026/151",
    "463/155",
    "37/160",
    "259/160",
    "1/164",
    "163/164",
    "6/169",
    "11/189",
    "367/189",
    "370/193",
    "1/196",
    "59/200",
    "83/200",
    "87/200",
    "103/200",
    "113/200",
    "117/200",
    "121/200",
    "131/200",
    "139/200",
    "143/200",
    "217/200",
    "227/200",
    "237/200",
    "271/200",
    "303/200",
    "317/200",
    "337/200",
    "339/200",
    "349/200",
    "353/200",
    "403/200",
    "419/200",
    "489/200",
    "531/200",
    "539/200",
    "561/200",
    "567/200",
    "589/200",
    "601/200",
    "607/200",
    "637/200",
    "639/200",
    "793/200",
    "799/200",
    "801/200",
    "987/200",
    "989/200",
    "991/200",
    "997/200",
    "999/200",
    "1157/200",
    "1213/200",
    "1243/200",
    "1259/200",
    "1263/200",
    "1273/200",
    "1281/200",
    "1331/200",
    "1337/200",
    "1357/200",
    "1363/200",
    "1369/200",
    "1371/200",
    "1373/200",
    "1379/200",
    "1381/200",
    "1383/200",
    "1397/200",
    "1403/200",
    "1411/200",
    "1439/200",
    "1531/200",
    "1537/200",
    "1567/200",
    "1591/200",
    "1593/200",
    "1609/200",
    "1639/200",
    "1649/200",
    "1651/200",
    "1721/200",
    "1883/200",
    "1991/200",
    "2043/200",
    "2147/200",
    "2269/200",
    "2357/200",
    "2359/200",
    "2361/200",
    "2593/200",
    "8479/200",
    "19889/200",
    "19921/200",
    "19989/200",
    "19997/200",
    "19999/200",
    "1/204",
    "103/204",
    "203/204",
    "231/221",
    "7/228",
    "449/228",
    "1/238",
    "237/238",
    "2/241",
    "4/241",
    "239/241",
    "478/241",
    "73/250",
    "77/250",
    "83/250",
    "87/250",
    "103/250",
    "107/250",
    "111/250",
    "113/250",
    "131/250",
    "137/250",
    "139/250",
    "167/250",
    "171/250",
    "173/250",
    "177/250",
    "179/250",
    "183/250",
    "187/250",
    "189/250",
    "197/250",
    "209/250",
    "227/250",
    "271/250",
    "319/250",
    "363/250",
    "383/250",
    "393/250",
    "399/250",
    "437/250",
    "447/250",
    "451/250",
    "457/250",
    "463/250",
    "601/250",
    "699/250",
    "711/250",
    "723/250",
    "729/250",
    "741/250",
    "749/250",
    "891/250",
    "937/250",
    "949/250",
    "951/250",
    "967/250",
    "981/250",
    "989/250",
    "997/250",
    "1003/250",
    "1007/250",
    "1017/250",
    "1021/250",
    "1027/250",
    "1093/250",
    "1243/250",
    "1251/250",
    "1467/250",
    "1469/250",
    "1477/250",
    "1499/250",
    "1513/250",
    "1541/250",
    "1543/250",
    "1587/250",
    "1603/250",
    "1619/250",
    "1629/250",
    "1639/250",
    "1667/250",
    "1679/250",
    "1683/250",
    "1689/250",
    "1691/250",
    "1693/250",
    "1699/250",
    "1701/250",
    "1703/250",
    "1713/250",
    "1719/250",
    "1727/250",
    "1731/250",
    "1743/250",
    "1777/250",
    "1793/250",
    "1871/250",
    "1873/250",
    "1969/250",
    "2049/250",
    "2053/250",
    "2079/250",
    "2107/250",
    "2337/250",
    "2451/250",
    "2487/250",
    "2491/250",
    "2679/250",
    "2923/250",
    "3563/250",
    "3663/250",
    "3683/250",
    "3697/250",
    "4047/250",
    "4133/250",
    "4137/250",
    "4141/250",
    "4383/250",
    "6931/250",
    "8491/250",
    "24991/250",
    "24997/250",
    "202/253",
    "401/261",
    "1/263",
    "262/263",
    "136/267",
    "267/277",
    "3/283",
    "280/283",
    "2/287",
    "1757/291",
    "100/297",
    "494/297",
    "9/301",
    "292/301",
    "9/302",
    "595/302",
    "1/303",
    "2/303",
    "4/303",
    "5/303",
    "298/303",
    "299/303",
    "301/303",
    "4/307",
    "47/318",
    "4/321",
    "25/332",
    "639/332",
    "2264/333",
    "121/342",
    "221/342",
    "1/345",
    "344/345",
    "100/351",
    "1/357",
    "356/357",
    "1483/363",
    "371/367",
    "105/373",
    "268/373",
    "59/377",
    "26/379",
    "353/379",
    "9/383",
    "155/383",
    "374/383",
    "732/385",
    "43/386",
    "729/386",
    "17/400",
    "51/400",
    "63/400",
    "79/400",
    "81/400",
    "91/400",
    "93/400",
    "97/400",
    "103/400",
    "157/400",
    "187/400",
    "193/400",
    "273/400",
    "279/400",
    "317/400",
    "391/400",
    "409/400",
    "579/400",
    "597/400",
    "599/400",
    "737/400",
    "783/400",
    "787/400",
    "799/400",
    "20349/400",
    "16/401",
    "32/401",
    "385/401",
    "100/409",
    "738/409",
    "2/421",
    "4/421",
    "5/422",
    "25/423",
    "821/423",
    "11/428",
    "29/429",
    "5548/429",
    "148/441",
    "734/441",
    "14/445",
    "876/445",
    "23/450",
    "463/465",
    "5/469",
    "13/471",
    "458/471",
    "134/473",
    "812/473",
    "1/476",
    "475/476",
    "19/481",
    "462/481",
    "15/487",
    "472/487",
    "60/491",
    "103/500",
    "141/500",
    "143/500",
    "157/500",
    "161/500",
    "163/500",
    "167/500",
    "169/500",
    "171/500",
    "181/500",
    "187/500",
    "199/500",
    "201/500",
    "209/500",
    "219/500",
    "227/500",
    "229/500",
    "231/500",
    "233/500",
    "253/500",
    "269/500",
    "271/500",
    "281/500",
    "289/500",
    "291/500",
    "299/500",
    "301/500",
    "317/500",
    "321/500",
    "327/500",
    "329/500",
    "331/500",
    "337/500",
    "363/500",
    "367/500",
    "369/500",
    "371/500",
    "381/500",
    "387/500",
    "397/500",
    "401/500",
    "403/500",
    "411/500",
    "417/500",
    "421/500",
    "433/500",
    "471/500",
    "503/500",
    "519/500",
    "533/500",
    "537/500",
    "559/500",
    "567/500",
    "579/500",
    "623/500",
    "639/500",
    "669/500",
    "673/500",
    "679/500",
    "687/500",
    "711/500",
    "713/500",
    "723/500",
    "733/500",
    "753/500",
    "763/500",
    "789/500",
    "793/500",
    "801/500",
    "813/500",
    "827/500",
    "839/500",
    "851/500",
    "873/500",
    "881/500",
    "893/500",
    "909/500",
    "919/500",
    "931/500",
    "939/500",
    "959/500",
    "971/500",
    "989/500",
    "993/500",
    "1001/500",
    "1071/500",
    "1129/500",
    "1203/500",
    "1287/500",
    "1307/500",
    "1371/500",
    "1377/500",
    "1401/500",
    "1403/500",
    "1413/500",
    "1451/500",
    "1453/500",
    "1461/500",
    "1463/500",
    "1469/500",
    "1473/500",
    "1481/500",
    "1487/500",
    "1527/500",
    "1737/500",
    "1961/500",
    "1967/500",
    "1969/500",
    "1971/500",
    "1973/500",
    "1987/500",
    "1993/500",
    "2001/500",
    "2007/500",
    "2013/500",
    "2023/500",
    "2039/500",
    "2081/500",
    "2243/500",
    "2469/500",
    "2473/500",
    "2481/500",
    "2493/500",
    "2499/500",
    "2743/500",
    "3017/500",
    "3021/500",
    "3031/500",
    "3037/500",
    "3039/500",
    "3041/500",
    "3059/500",
    "3061/500",
    "3083/500",
    "3091/500",
    "3101/500",
    "3121/500",
    "3149/500",
    "3173/500",
    "3201/500",
    "3207/500",
    "3211/500",
    "3231/500",
    "3257/500",
    "3273/500",
    "3277/500",
    "3281/500",
    "3293/500",
    "3301/500",
    "3311/500",
    "3313/500",
    "3319/500",
    "3343/500",
    "3351/500",
    "3353/500",
    "3367/500",
    "3379/500",
    "3397/500",
    "3399/500",
    "3403/500",
    "3409/500",
    "3419/500",
    "3427/500",
    "3433/500",
    "3437/500",
    "3443/500",
    "3451/500",
    "3459/500",
    "3471/500",
