{
  "version": "V14.0",
  "description": "Isotope vocabulary for V14.0 tokenizer \u2014 single semantic tokens per isotope",
  "source": "src/superconductor/encoders/isotope_properties.py (ISOTOPE_DATABASE)",
  "n_isotopes": 291,
  "n_elements_with_isotopes": 84,
  "isotopes": [
    "1H",
    "2H",
    "3H",
    "3He",
    "4He",
    "6Li",
    "7Li",
    "9Be",
    "10B",
    "11B",
    "12C",
    "13C",
    "14C",
    "14N",
    "15N",
    "16O",
    "17O",
    "18O",
    "19F",
    "20Ne",
    "21Ne",
    "22Ne",
    "23Na",
    "24Mg",
    "25Mg",
    "26Mg",
    "27Al",
    "28Si",
    "29Si",
    "30Si",
    "31P",
    "32S",
    "33S",
    "34S",
    "36S",
    "35Cl",
    "37Cl",
    "36Ar",
    "38Ar",
    "40Ar",
    "39K",
    "40K",
    "41K",
    "40Ca",
    "42Ca",
    "43Ca",
    "44Ca",
    "46Ca",
    "48Ca",
    "45Sc",
    "46Ti",
    "47Ti",
    "48Ti",
    "49Ti",
    "50Ti",
    "50V",
    "51V",
    "50Cr",
    "52Cr",
    "53Cr",
    "54Cr",
    "55Mn",
    "54Fe",
    "56Fe",
    "57Fe",
    "58Fe",
    "59Co",
    "58Ni",
    "60Ni",
    "61Ni",
    "62Ni",
    "64Ni",
    "63Cu",
    "65Cu",
    "64Zn",
    "66Zn",
    "67Zn",
    "68Zn",
    "70Zn",
    "69Ga",
    "71Ga",
    "70Ge",
    "72Ge",
    "73Ge",
    "74Ge",
    "76Ge",
    "75As",
    "74Se",
    "76Se",
    "77Se",
    "78Se",
    "80Se",
    "82Se",
    "79Br",
    "81Br",
    "78Kr",
    "80Kr",
    "82Kr",
    "83Kr",
    "84Kr",
    "86Kr",
    "85Rb",
    "87Rb",
    "84Sr",
    "86Sr",
    "87Sr",
    "88Sr",
    "89Y",
    "90Zr",
    "91Zr",
    "92Zr",
    "94Zr",
    "96Zr",
    "93Nb",
    "92Mo",
    "94Mo",
    "95Mo",
    "96Mo",
    "97Mo",
    "98Mo",
    "100Mo",
    "98Tc",
    "99Tc",
    "96Ru",
    "98Ru",
    "99Ru",
    "100Ru",
    "101Ru",
    "102Ru",
    "104Ru",
    "103Rh",
    "102Pd",
    "104Pd",
    "105Pd",
    "106Pd",
    "108Pd",
    "110Pd",
    "107Ag",
    "109Ag",
    "106Cd",
    "108Cd",
    "110Cd",
    "111Cd",
    "112Cd",
    "113Cd",
    "114Cd",
    "116Cd",
    "113In",
    "115In",
    "112Sn",
    "114Sn",
    "115Sn",
    "116Sn",
    "117Sn",
    "118Sn",
    "119Sn",
    "120Sn",
    "122Sn",
    "124Sn",
    "121Sb",
    "123Sb",
    "120Te",
    "122Te",
    "123Te",
    "124Te",
    "125Te",
    "126Te",
    "128Te",
    "130Te",
    "127I",
    "124Xe",
    "126Xe",
    "128Xe",
    "129Xe",
    "130Xe",
    "131Xe",
    "132Xe",
    "134Xe",
    "136Xe",
    "133Cs",
    "130Ba",
    "132Ba",
    "134Ba",
    "135Ba",
    "136Ba",
    "137Ba",
    "138Ba",
    "138La",
    "139La",
    "136Ce",
    "138Ce",
    "140Ce",
    "142Ce",
    "141Pr",
    "142Nd",
    "143Nd",
    "144Nd",
    "145Nd",
    "146Nd",
    "148Nd",
    "150Nd",
    "144Sm",
    "147Sm",
    "148Sm",
    "149Sm",
    "150Sm",
    "152Sm",
    "154Sm",
    "151Eu",
    "153Eu",
    "152Gd",
    "154Gd",
    "155Gd",
    "156Gd",
    "157Gd",
    "158Gd",
    "160Gd",
    "159Tb",
    "156Dy",
    "158Dy",
    "160Dy",
    "161Dy",
    "162Dy",
    "163Dy",
    "164Dy",
    "165Ho",
    "162Er",
    "164Er",
    "166Er",
    "167Er",
    "168Er",
    "170Er",
    "169Tm",
    "168Yb",
    "170Yb",
    "171Yb",
    "172Yb",
    "173Yb",
    "174Yb",
    "176Yb",
    "175Lu",
    "176Lu",
    "174Hf",
    "176Hf",
    "177Hf",
    "178Hf",
    "179Hf",
    "180Hf",
    "180Ta",
    "181Ta",
    "180W",
    "182W",
    "183W",
    "184W",
    "186W",
    "185Re",
    "187Re",
    "184Os",
    "186Os",
    "187Os",
    "188Os",
    "189Os",
    "190Os",
    "192Os",
    "191Ir",
    "193Ir",
    "190Pt",
    "192Pt",
    "194Pt",
    "195Pt",
    "196Pt",
    "198Pt",
    "197Au",
    "196Hg",
    "198Hg",
    "199Hg",
    "200Hg",
    "201Hg",
    "202Hg",
    "204Hg",
    "203Tl",
    "205Tl",
    "204Pb",
    "206Pb",
    "207Pb",
    "208Pb",
    "209Bi",
    "232Th",
    "234U",
    "235U",
    "238U"
  ],
  "element_isotope_counts": {
    "H": 3,
    "He": 2,
    "Li": 2,
    "Be": 1,
    "B": 2,
    "C": 3,
    "N": 2,
    "O": 3,
    "F": 1,
    "Ne": 3,
    "Na": 1,
    "Mg": 3,
    "Al": 1,
    "Si": 3,
    "P": 1,
    "S": 4,
    "Cl": 2,
    "Ar": 3,
    "K": 3,
    "Ca": 6,
    "Sc": 1,
    "Ti": 5,
    "V": 2,
    "Cr": 4,
    "Mn": 1,
    "Fe": 4,
    "Co": 1,
    "Ni": 5,
    "Cu": 2,
    "Zn": 5,
    "Ga": 2,
    "Ge": 5,
    "As": 1,
    "Se": 6,
    "Br": 2,
    "Kr": 6,
    "Rb": 2,
    "Sr": 4,
    "Y": 1,
    "Zr": 5,
    "Nb": 1,
    "Mo": 7,
    "Tc": 2,
    "Ru": 7,
    "Rh": 1,
    "Pd": 6,
    "Ag": 2,
    "Cd": 8,
    "In": 2,
    "Sn": 10,
    "Sb": 2,
    "Te": 8,
    "I": 1,
    "Xe": 9,
    "Cs": 1,
    "Ba": 7,
    "La": 2,
    "Ce": 4,
    "Pr": 1,
    "Nd": 7,
    "Sm": 7,
    "Eu": 2,
    "Gd": 7,
    "Tb": 1,
    "Dy": 7,
    "Ho": 1,
    "Er": 6,
    "Tm": 1,
    "Yb": 7,
    "Lu": 2,
    "Hf": 6,
    "Ta": 2,
    "W": 5,
    "Re": 2,
    "Os": 7,
    "Ir": 2,
    "Pt": 6,
    "Au": 1,
    "Hg": 7,
    "Tl": 2,
    "Pb": 4,
    "Bi": 1,
    "Th": 1,
    "U": 3
  }
}